{
  "vocab_size": 30,
  "special_tokens": {
    "pad": 0,
    "sos": 2,
    "eos": 3
  },
  "idx_to_char": {
    "0": "<pad>",
    "1": "<unk>",
    "2": "<sos>",
    "3": "<eos>",
    "4": "a",
    "5": "b",
    "6": "c",
    "7": "d",
    "8": "e",
    "9": "f",
    "10": "g",
    "11": "h",
    "12": "i",
    "13": "j",
    "14": "k",
    "15": "l",
    "16": "m",
    "17": "n",
    "18": "o",
    "19": "p",
    "20": "q",
    "21": "r",
    "22": "s",
    "23": "t",
    "24": "u",
    "25": "v",
    "26": "w",
    "27": "x",
    "28": "y",
    "29": "z"
  }
}